In [19]:
import pandas as pd

In [50]:
df = pd.read_csv("archive/world_population_by_year_1950_2023.csv")

In [65]:
df[["country"] + [col for col in df.columns if col != "country" and int(col) >= 2019]].head().to_dict("records")

[{'country': 'Afghanistan',
  '2019': 37769499,
  '2020': 38972230,
  '2021': 40099462,
  '2022': 41128771,
  '2023': 42239854},
 {'country': 'Albania',
  '2019': 2873883,
  '2020': 2866849,
  '2021': 2854710,
  '2022': 2842321,
  '2023': 2832439},
 {'country': 'Algeria',
  '2019': 42705368,
  '2020': 43451666,
  '2021': 44177969,
  '2022': 44903225,
  '2023': 45606480},
 {'country': 'American Samoa',
  '2019': 47321,
  '2020': 46189,
  '2021': 45035,
  '2022': 44273,
  '2023': 43914},
 {'country': 'Andorra',
  '2019': 76343,
  '2020': 77700,
  '2021': 79034,
  '2022': 79824,
  '2023': 80088}]

In [66]:
sample = df.query("country == 'Uruguay'")
sample

,country,1950,1951,1952,1953,1954,1955,1956,1957,1958,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
224,Uruguay,2234144,2256072,2280660,2307491,2336182,2366209,2397436,2429787,2462876,...,3391662,3402818,3413766,3422200,3427042,3428409,3429086,3426260,3422794,3423108

In [78]:
melted_df = df.melt(id_vars=['country'], var_name='year', value_name='population')
melted_df['population_growth'] = melted_df.groupby("country")["population"].diff()
melted_df

               country  year  population  population_growth
0          Afghanistan  1950     7480461                NaN
1              Albania  1950     1252582                NaN
2              Algeria  1950     9019866                NaN
3       American Samoa  1950       19032                NaN
4              Andorra  1950        6005                NaN
...                ...   ...         ...                ...
17311  Wallis & Futuna  2023       11502              -70.0
17312   Western Sahara  2023      587259            11273.0
17313            Yemen  2023    34449825           753211.0
17314           Zambia  2023    20569737           552062.0
17315         Zimbabwe  2023    16665409           344872.0

[17316 rows x 4 columns]

In [80]:
years = list(range(1950, 2024))
year_stack = ", ".join(f"'{year}', {year}" for year in years)
f"stack({len(years)}, {year_stack}) as (year, population)"

"stack(74, '1950', 1950, '1951', 1951, '1952', 1952, '1953', 1953, '1954', 1954, '1955', 1955, '1956', 1956, '1957', 1957, '1958', 1958, '1959', 1959, '1960', 1960, '1961', 1961, '1962', 1962, '1963', 1963, '1964', 1964, '1965', 1965, '1966', 1966, '1967', 1967, '1968', 1968, '1969', 1969, '1970', 1970, '1971', 1971, '1972', 1972, '1973', 1973, '1974', 1974, '1975', 1975, '1976', 1976, '1977', 1977, '1978', 1978, '1979', 1979, '1980', 1980, '1981', 1981, '1982', 1982, '1983', 1983, '1984', 1984, '1985', 1985, '1986', 1986, '1987', 1987, '1988', 1988, '1989', 1989, '1990', 1990, '1991', 1991, '1992', 1992, '1993', 1993, '1994', 1994, '1995', 1995, '1996', 1996, '1997', 1997, '1998', 1998, '1999', 1999, '2000', 2000, '2001', 2001, '2002', 2002, '2003', 2003, '2004', 2004, '2005', 2005, '2006', 2006, '2007', 2007, '2008', 2008, '2009', 2009, '2010', 2010, '2011', 2011, '2012', 2012, '2013', 2013, '2014', 2014, '2015', 2015, '2016', 2016, '2017', 2017, '2018', 2018, '2019', 2019, '2020', 2020, '2021', 2021, '2022', 2022, '2023', 2023) as (year, population)"

In [86]:
print(melted_df[["country", "year", "population"]].head(20))

                country  year  population
0           Afghanistan  1950     7480461
1               Albania  1950     1252582
2               Algeria  1950     9019866
3        American Samoa  1950       19032
4               Andorra  1950        6005
5                Angola  1950     4478184
6              Anguilla  1950        5017
7   Antigua and Barbuda  1950       45435
8             Argentina  1950    17017742
9               Armenia  1950     1385041
10                Aruba  1950       38797
11            Australia  1950     8177167
12              Austria  1950     6936440
13           Azerbaijan  1950     3158966
14              Bahamas  1950       81644
15              Bahrain  1950      117149
16           Bangladesh  1950    39728535
17             Barbados  1950      210548
18              Belarus  1950     7906860
19              Belgium  1950     8617344